zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf52840.svd
          <register>
            <name>T0</name>
            <description>Segment end T0</description>
            <addressOffset>0x030</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFE2</resetValue>
            <fields>
              <field>
                <name>T</name>
                <description>T (segment end) register</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>T1</name>
            <description>Segment end T1</description>
            <addressOffset>0x034</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFF00</resetValue>
            <fields>
              <field>
                <name>T</name>
                <description>T (segment end) register</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>T2</name>
            <description>Segment end T2</description>
            <addressOffset>0x038</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFF14</resetValue>
            <fields>
              <field>
                <name>T</name>
                <description>T (segment end) register</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>T3</name>
            <description>Segment end T3</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFF19</resetValue>
            <fields>
              <field>
                <name>T</name>
                <description>T (segment end) register</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>T4</name>
            <description>Segment end T4</description>
            <addressOffset>0x040</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFF50</resetValue>
            <fields>
              <field>
                <name>T</name>
                <description>T (segment end) register</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>NFC</name>
          <description>Unspecified</description>
          <headerStructName>FICR_NFC</headerStructName>
          <addressOffset>0x450</addressOffset>
          <register>
            <name>TAGHEADER0</name>
            <description>Default header for NFC tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFF5F</resetValue>
            <fields>
              <field>
                <name>MFGID</name>
                <description>Default Manufacturer ID: Nordic Semiconductor ASA has ICM 0x5F</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD1</name>
                <description>Unique identifier byte 1</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD2</name>
                <description>Unique identifier byte 2</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD3</name>
                <description>Unique identifier byte 3</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER1</name>
            <description>Default header for NFC tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>UD4</name>
                <description>Unique identifier byte 4</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD5</name>
                <description>Unique identifier byte 5</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD6</name>
                <description>Unique identifier byte 6</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD7</name>
                <description>Unique identifier byte 7</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER2</name>
            <description>Default header for NFC tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>UD8</name>
                <description>Unique identifier byte 8</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD9</name>
                <description>Unique identifier byte 9</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD10</name>
                <description>Unique identifier byte 10</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD11</name>
                <description>Unique identifier byte 11</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER3</name>
            <description>Default header for NFC tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>UD12</name>
                <description>Unique identifier byte 12</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD13</name>
                <description>Unique identifier byte 13</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD14</name>
                <description>Unique identifier byte 14</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD15</name>
                <description>Unique identifier byte 15</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TRNG90B</name>
          <description>NIST800-90B RNG calibration data</description>
          <headerStructName>FICR_TRNG90B</headerStructName>
          <addressOffset>0xC00</addressOffset>
          <register>
            <name>BYTES</name>
            <description>Amount of bytes for the required entropy bits</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>BYTES</name>
                <description>Amount of bytes for the required entropy bits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RCCUTOFF</name>
            <description>Repetition counter cutoff</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>RCCUTOFF</name>
                <description>Repetition counter cutoff</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>APCUTOFF</name>
            <description>Adaptive proportion cutoff</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>APCUTOFF</name>
                <description>Adaptive proportion cutoff</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STARTUP</name>
            <description>Amount of bytes for the startup tests</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000210</resetValue>
            <fields>
              <field>
                <name>STARTUP</name>
                <description>Amount of bytes for the startup tests</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ROSC1</name>
            <description>Sample count for ring oscillator 1</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC1</name>
                <description>Sample count for ring oscillator 1</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ROSC2</name>
            <description>Sample count for ring oscillator 2</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC2</name>
                <description>Sample count for ring oscillator 2</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ROSC3</name>
            <description>Sample count for ring oscillator 3</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC3</name>
                <description>Sample count for ring oscillator 3</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ROSC4</name>
            <description>Sample count for ring oscillator 4</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC4</name>
                <description>Sample count for ring oscillator 4</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
