zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf52840.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI0</name>
      <description>Serial Peripheral Interface 0</description>
      <baseAddress>0x40003000</baseAddress>
      <headerStructName>SPI</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0</name>
        <value>3</value>
      </interrupt>
      <groupName>SPI</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>EVENTS_READY</name>
          <description>TXD byte sent and RXD byte received</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_READY</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>READY</name>
              <description>Write '1' to enable interrupt for READY event</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>READY</name>
              <description>Write '1' to disable interrupt for READY event</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable SPI</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable SPI</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable SPI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable SPI</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>SPI_PSEL</headerStructName>
          <addressOffset>0x508</addressOffset>
          <register>
            <name>SCK</name>
            <description>Pin select for SCK</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MOSI</name>
            <description>Pin select for MOSI signal</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MISO</name>
            <description>Pin select for MISO signal</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>RXD</name>
          <description>RXD register</description>
          <addressOffset>0x518</addressOffset>
          <access>read-only</access>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>RXD</name>
              <description>RX data received. Double buffered</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXD</name>
          <description>TXD register</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXD</name>
              <description>TX data to send. Double buffered</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY</name>
          <description>SPI frequency. Accuracy depends on the HFCLK source selected.</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <resetValue>0x04000000</resetValue>
          <fields>
            <field>
              <name>FREQUENCY</name>
              <description>SPI master data rate</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>K125</name>
                  <description>125 kbps</description>
                  <value>0x02000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K250</name>
                  <description>250 kbps</description>
                  <value>0x04000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K500</name>
                  <description>500 kbps</description>
                  <value>0x08000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1</name>
                  <description>1 Mbps</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2</name>
                  <description>2 Mbps</description>
                  <value>0x20000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4</name>
                  <description>4 Mbps</description>
                  <value>0x40000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M8</name>
                  <description>8 Mbps</description>
                  <value>0x80000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration register</description>
          <addressOffset>0x554</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ORDER</name>
              <description>Bit order</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MsbFirst</name>
                  <description>Most significant bit shifted out first</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LsbFirst</name>
                  <description>Least significant bit shifted out first</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>Serial clock (SCK) phase</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Leading</name>
                  <description>Sample on leading edge of clock, shift serial data on trailing edge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trailing</name>
                  <description>Sample on trailing edge of clock, shift serial data on leading edge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOL</name>
              <description>Serial clock (SCK) polarity</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ActiveHigh</name>
                  <description>Active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ActiveLow</name>
                  <description>Active low</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
