zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf52840.svd
        <register>
          <name>RATIO</name>
          <description>Selects the ratio between PDM_CLK and output sample rate. Change PDMCLKCTRL accordingly.</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATIO</name>
              <description>Selects the ratio between PDM_CLK and output sample rate</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ratio64</name>
                  <description>Ratio of 64</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ratio80</name>
                  <description>Ratio of 80</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>PDM_PSEL</headerStructName>
          <addressOffset>0x540</addressOffset>
          <register>
            <name>CLK</name>
            <description>Pin number configuration for PDM CLK signal</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DIN</name>
            <description>Pin number configuration for PDM DIN signal</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>SAMPLE</name>
          <description>Unspecified</description>
          <headerStructName>PDM_SAMPLE</headerStructName>
          <addressOffset>0x560</addressOffset>
          <register>
            <name>PTR</name>
            <description>RAM address pointer to write samples to with EasyDMA</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SAMPLEPTR</name>
                <description>Address to write PDM samples to over DMA</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Number of samples to allocate memory for in EasyDMA mode</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>BUFFSIZE</name>
                <description>Length of DMA RAM allocation in number of samples</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>ACL</name>
      <description>Access control lists</description>
      <baseAddress>0x4001E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ACL</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>ACL[%s]</name>
          <description>Unspecified</description>
          <headerStructName>ACL_ACL</headerStructName>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>ADDR</name>
            <description>Description cluster[n]: Configure the word-aligned start address of region n to protect</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Valid word-aligned start address of region n to protect. Address must point to a flash page boundary.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SIZE</name>
            <description>Description cluster[n]: Size of region to protect counting from address ACL[n].ADDR. Write '0' as no effect.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Size of flash region n in bytes. Must be a multiple of the flash page size, and the maximum region size is limited to 512kB.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PERM</name>
            <description>Description cluster[n]: Access permissions for region n as defined by start address ACL[n].ADDR and size ACL[n].SIZE</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>WRITE</name>
                <description>Configure write and erase permissions for region n. Write '0' has no effect.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow write and erase instructions to region n</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block write and erase instructions to region n</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READ</name>
                <description>Configure read permissions for region n. Write '0' has no effect.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow read instructions to region n</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block read instructions to region n</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>UNUSED0</name>
            <description>Unspecified</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
