zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf52840.svd
        <register>
          <name>EPSTATUS</name>
          <description>Provides information on which endpoint's EasyDMA registers have been captured</description>
          <addressOffset>0x468</addressOffset>
          <access>read-write</access>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>EPIN0</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN1</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN2</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN3</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN4</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN5</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN6</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN7</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN8</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT0</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT1</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT2</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT3</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT4</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT5</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT6</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT7</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT8</name>
              <description>Captured state of endpoint's EasyDMA registers. Write '1' to clear.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoData</name>
                  <description>EasyDMA registers have not been captured for this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>EasyDMA registers have been captured for this endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
