zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf52840.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="UARTE0">
      <name>UARTE1</name>
      <description>UART with EasyDMA 1</description>
      <baseAddress>0x40028000</baseAddress>
      <interrupt>
        <name>UARTE1</name>
        <value>40</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>QSPI</name>
      <description>External flash interface</description>
      <baseAddress>0x40029000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>QSPI</name>
        <value>41</value>
      </interrupt>
      <groupName>QSPI</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_ACTIVATE</name>
          <description>Activate QSPI interface</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_ACTIVATE</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_READSTART</name>
          <description>Start transfer from external flash memory to internal RAM</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_READSTART</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_WRITESTART</name>
          <description>Start transfer from internal RAM to external flash memory</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_WRITESTART</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_ERASESTART</name>
          <description>Start external flash memory erase operation</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_ERASESTART</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DEACTIVATE</name>
          <description>Deactivate QSPI interface</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DEACTIVATE</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_READY</name>
          <description>QSPI peripheral is ready. This event will be generated as a response to any QSPI task.</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_READY</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>READY</name>
              <description>Enable or disable interrupt for READY event</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>READY</name>
              <description>Write '1' to enable interrupt for READY event</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>READY</name>
              <description>Write '1' to disable interrupt for READY event</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable QSPI peripheral and acquire the pins selected in PSELn registers</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable QSPI</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable QSPI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable QSPI</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>READ</name>
          <description>Unspecified</description>
          <headerStructName>QSPI_READ</headerStructName>
          <addressOffset>0x504</addressOffset>
          <register>
            <name>SRC</name>
            <description>Flash memory source address</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SRC</name>
                <description>Word-aligned flash memory source address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DST</name>
            <description>RAM destination address</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DST</name>
                <description>Word-aligned RAM destination address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CNT</name>
            <description>Read transfer length</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CNT</name>
                <description>Read transfer length in number of bytes. The length must be a multiple of 4 bytes.</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WRITE</name>
          <description>Unspecified</description>
          <headerStructName>QSPI_WRITE</headerStructName>
          <addressOffset>0x510</addressOffset>
          <register>
            <name>DST</name>
            <description>Flash destination address</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DST</name>
                <description>Word-aligned flash destination address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>RAM source address</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SRC</name>
                <description>Word-aligned RAM source address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CNT</name>
            <description>Write transfer length</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CNT</name>
                <description>Write transfer length in number of bytes. The length must be a multiple of 4 bytes.</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>ERASE</name>
          <description>Unspecified</description>
          <headerStructName>QSPI_ERASE</headerStructName>
          <addressOffset>0x51C</addressOffset>
          <register>
            <name>PTR</name>
            <description>Start address of flash block to be erased</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PTR</name>
                <description>Word-aligned start address of block to be erased.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LEN</name>
            <description>Size of block to be erased.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>4KB</name>
                    <description>Erase 4 kB block (flash command 0x20)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64KB</name>
                    <description>Erase 64 kB block (flash command 0xD8)</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>All</name>
                    <description>Erase all (flash command 0xC7)</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>QSPI_PSEL</headerStructName>
          <addressOffset>0x524</addressOffset>
          <register>
            <name>SCK</name>
            <description>Pin select for serial clock SCK</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CSN</name>
            <description>Pin select for chip select signal CSN.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IO0</name>
            <description>Pin select for serial data MOSI/IO0.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IO1</name>
            <description>Pin select for serial data MISO/IO1.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IO2</name>
            <description>Pin select for serial data IO2.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IO3</name>
            <description>Pin select for serial data IO3.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>XIPOFFSET</name>
          <description>Address offset into the external memory for Execute in Place operation.</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>XIPOFFSET</name>
              <description>Address offset into the external memory for Execute in Place operation. Value must be a multiple of 4.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
