zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf52840.svd
        <register>
          <name>IFCONFIG0</name>
          <description>Interface configuration.</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>READOC</name>
              <description>Configure number of data lines and opcode used for reading.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FASTREAD</name>
                  <description>Single data line SPI. FAST_READ (opcode 0x0B).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ2O</name>
                  <description>Dual data line SPI. READ2O (opcode 0x3B).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ2IO</name>
                  <description>Dual data line SPI. READ2IO (opcode 0xBB).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ4O</name>
                  <description>Quad data line SPI. READ4O (opcode 0x6B).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ4IO</name>
                  <description>Quad data line SPI. READ4IO (opcode 0xEB).</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRITEOC</name>
              <description>Configure number of data lines and opcode used for writing.</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PP</name>
                  <description>Single data line SPI. PP (opcode 0x02).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP2O</name>
                  <description>Dual data line SPI. PP2O (opcode 0xA2).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP4O</name>
                  <description>Quad data line SPI. PP4O (opcode 0x32).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP4IO</name>
                  <description>Quad data line SPI. PP4IO (opcode 0x38).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRMODE</name>
              <description>Addressing mode.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24BIT</name>
                  <description>24-bit addressing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BIT</name>
                  <description>32-bit addressing.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPMENABLE</name>
              <description>Enable deep power-down mode (DPM) feature.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable DPM feature.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable DPM feature.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPSIZE</name>
              <description>Page size for commands PP, PP2O, PP4O and PP4IO.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>256Bytes</name>
                  <description>256 bytes.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512Bytes</name>
                  <description>512 bytes.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCONFIG1</name>
          <description>Interface configuration.</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00040480</resetValue>
          <fields>
            <field>
              <name>SCKDELAY</name>
              <description>Minimum amount of time that the CSN pin must stay high before it can go low again. Value is specified in number of 16 MHz periods (62.5 ns).</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DPMEN</name>
              <description>Enter/exit deep power-down mode (DPM) for external flash memory.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Exit</name>
                  <description>Exit DPM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enter</name>
                  <description>Enter DPM.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIMODE</name>
              <description>Select SPI mode.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE0</name>
                  <description>Mode 0: Data are captured on the clock rising edge and data is output on a falling edge. Base level of clock is 0 (CPOL=0, CPHA=0).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>Mode 3: Data are captured on the clock falling edge and data is output on a rising edge. Base level of clock is 1 (CPOL=1, CPHA=1).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCKFREQ</name>
              <description>SCK frequency is given as 32 MHz / (SCKFREQ + 1).</description>
              <lsb>28</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status register.</description>
          <addressOffset>0x604</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DPM</name>
              <description>Deep power-down mode (DPM) status of external flash.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>External flash is not in DPM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>External flash is in DPM.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READY</name>
              <description>Ready status.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READY</name>
                  <description>QSPI peripheral is ready. It is allowed to trigger new tasks, writing custom instructions or enter/exit DPM.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>QSPI peripheral is busy. It is not allowed to trigger any new tasks, writing custom instructions or enter/exit DPM.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SREG</name>
              <description>Value of external flash device Status Register. When the external flash has two bytes status register this field includes the value of the low byte.</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DPMDUR</name>
          <description>Set the duration required to enter/exit deep power-down mode (DPM).</description>
          <addressOffset>0x614</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ENTER</name>
              <description>Duration needed by external flash to enter DPM. Duration is given as ENTER * 256 * 62.5 ns.</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>EXIT</name>
              <description>Duration needed by external flash to exit DPM. Duration is given as EXIT * 256 * 62.5 ns.</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRCONF</name>
          <description>Extended address configuration.</description>
          <addressOffset>0x624</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000B7</resetValue>
          <fields>
            <field>
              <name>OPCODE</name>
              <description>Opcode that enters the 32-bit addressing mode.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>BYTE0</name>
              <description>Byte 0 following opcode.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BYTE1</name>
              <description>Byte 1 following byte 0.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>MODE</name>
              <description>Extended addressing mode.</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoInstr</name>
                  <description>Do not send any instruction.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Opcode</name>
                  <description>Send opcode.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpByte0</name>
                  <description>Send opcode, byte0.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>All</name>
                  <description>Send opcode, byte0, byte1.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIPWAIT</name>
              <description>Wait for write complete before sending command.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>No wait.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Wait.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WREN</name>
              <description>Send WREN (write enable opcode 0x06) before instruction.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Do not send WREN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Send WREN.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CINSTRCONF</name>
          <description>Custom instruction configuration register.</description>
          <addressOffset>0x634</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002000</resetValue>
          <fields>
            <field>
              <name>OPCODE</name>
              <description>Opcode of Custom instruction.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>LENGTH</name>
              <description>Length of custom instruction in number of bytes.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1B</name>
                  <description>Send opcode only.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT0.BYTE1.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT0.BYTE2.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT0.BYTE3.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT1.BYTE4.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT1.BYTE5.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT1.BYTE6.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT1.BYTE7.</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LIO2</name>
              <description>Level of the IO2 pin (if connected) during transmission of custom instruction.</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>LIO3</name>
              <description>Level of the IO3 pin (if connected) during transmission of custom instruction.</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>WIPWAIT</name>
              <description>Wait for write complete before sending command.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>No wait.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Wait.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WREN</name>
              <description>Send WREN (write enable opcode 0x06) before instruction.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Do not send WREN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Send WREN.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFEN</name>
              <description>Enable long frame mode. When enabled, a custom instruction transaction has to be ended by writing the LFSTOP field.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Long frame mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Long frame mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFSTOP</name>
              <description>Stop (finalize) long frame transaction</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Stop</name>
                  <description>Stop</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CINSTRDAT0</name>
          <description>Custom instruction data register 0.</description>
          <addressOffset>0x638</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYTE0</name>
              <description>Data byte 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>BYTE1</name>
              <description>Data byte 1</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BYTE2</name>
              <description>Data byte 2</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>BYTE3</name>
              <description>Data byte 3</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CINSTRDAT1</name>
          <description>Custom instruction data register 1.</description>
          <addressOffset>0x63C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYTE4</name>
              <description>Data byte 4</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>BYTE5</name>
              <description>Data byte 5</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BYTE6</name>
              <description>Data byte 6</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>BYTE7</name>
              <description>Data byte 7</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IFTIMING</name>
          <description>SPI interface timing.</description>
          <addressOffset>0x640</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>RXDELAY</name>
              <description>Timing related to sampling of the input serial data. The value of RXDELAY specifies the number of 64 MHz cycles (15.625 ns) delay from the the rising edge of the SPI Clock (SCK) until the input serial data is sampled. As en example, if set to 0 the input serial data is sampled on the rising edge of SCK.</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
          </fields>
        </register>
