zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf52840.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="P0">
      <name>P1</name>
      <description>GPIO Port 2</description>
      <baseAddress>0x50000300</baseAddress>
      <alternatePeripheral>P0</alternatePeripheral>
    </peripheral>
    <peripheral>
      <name>CC_HOST_RGF</name>
      <description>CRYPTOCELL HOST_RGF interface</description>
      <baseAddress>0x5002A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CC_HOST_RGF</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>HOST_CRYPTOKEY_SEL</name>
          <description>AES hardware key select</description>
          <addressOffset>0x1A38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HOST_CRYPTOKEY_SEL</name>
              <description>Select the source of the HW key that is used by the AES engine</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>K_DR</name>
                  <description>Use device root key K_DR from CRYPTOCELL AO power domain</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K_PRTL</name>
                  <description>Use hard-coded RTL key K_PRTL</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Session</name>
                  <description>Use provided session key</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_IOT_KPRTL_LOCK</name>
          <description>This write-once register is the K_PRTL lock register. When this register is set, K_PRTL can not be used and a zeroed key will be used instead. The value of this register is saved in the CRYPTOCELL AO power domain.</description>
          <addressOffset>0x1A4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HOST_IOT_KPRTL_LOCK</name>
              <description>This register is the K_PRTL lock register. When this register is set, K_PRTL can not be used and a zeroed key will be used instead. The value of this register is saved in the CRYPTOCELL AO power domain.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>K_PRTL can be selected for use from register HOST_CRYPTOKEY_SEL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>K_PRTL has been locked until next power-on reset (POR). If K_PRTL is selected anyway, a zeroed key will be used instead.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_IOT_KDR0</name>
          <description>This register holds bits 31:0 of K_DR. The value of this register is saved in the CRYPTOCELL AO power domain. Reading from this address returns the K_DR valid status indicating if K_DR is successfully retained.</description>
          <addressOffset>0x1A50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HOST_IOT_KDR0</name>
              <description>Write: K_DR bits 31:0 Read: 0x00000000 when 128-bit K_DR key value is not yet retained in the CRYPTOCELL AO power domain Read: 0x00000001 when 128-bit K_DR key value is successfully retained in the CRYPTOCELL AO power domain</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_IOT_KDR1</name>
          <description>This register holds bits 63:32 of K_DR. The value of this register is saved in the CRYPTOCELL AO power domain.</description>
          <addressOffset>0x1A54</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HOST_IOT_KDR1</name>
              <description>K_DR bits 63:32</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_IOT_KDR2</name>
          <description>This register holds bits 95:64 of K_DR. The value of this register is saved in the CRYPTOCELL AO power domain.</description>
          <addressOffset>0x1A58</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HOST_IOT_KDR2</name>
              <description>K_DR bits 95:64</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_IOT_KDR3</name>
          <description>This register holds bits 127:96 of K_DR. The value of this register is saved in the CRYPTOCELL AO power domain.</description>
          <addressOffset>0x1A5C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HOST_IOT_KDR3</name>
              <description>K_DR bits 127:96</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_IOT_LCS</name>
          <description>Controls lifecycle state (LCS) for CRYPTOCELL subsystem</description>
          <addressOffset>0x1A60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>LCS</name>
              <description>Lifecycle state value. This field is write-once per reset.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Debug</name>
                  <description>CC310 operates in debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Secure</name>
                  <description>CC310 operates in secure mode</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCS_IS_VALID</name>
              <description>This field is read-only and indicates if CRYPTOCELL LCS has been successfully configured since last reset</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Invalid</name>
                  <description>A valid LCS is not yet retained in the CRYPTOCELL AO power domain</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Valid</name>
                  <description>A valid LCS is successfully retained in the CRYPTOCELL AO power domain</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
